bench/reproducible/results/20260522T185949Z/raw/fiber-throughput-plaintext-handler-warmup.txt
Running 15s test @ http://127.0.0.1:33002/plaintext-handler
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   478.24us  655.75us  13.32ms   90.68%
    Req/Sec   163.73k    31.26k  232.46k    57.83%
  Latency Distribution
     50%  263.00us
     75%  509.00us
     90%    1.07ms
     99%    3.38ms
  9775696 requests in 15.02s, 1.18GB read
Requests/sec: 650852.81
Transfer/sec:     80.69MB