bench/reproducible/results/20260522T185949Z/raw/kruda-throughput-json-static-round-2.txt
Running 15s test @ http://127.0.0.1:33000/json-static
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   684.99us    1.18ms  21.97ms   89.41%
    Req/Sec   171.15k    33.71k  240.41k    55.83%
  Latency Distribution
     50%  207.00us
     75%  682.00us
     90%    1.95ms
     99%    5.54ms
  10213904 requests in 15.02s, 1.43GB read
Requests/sec: 680049.49
Transfer/sec:     97.28MB